Revit 2027 API
ExporterIFC.GetRelatedElements Method
 Gets all elements not associated to stories.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<IFCAnyHandle> GetRelatedElements()
Public Function GetRelatedElements As ICollection(Of IFCAnyHandle)
public:
ICollection<IFCAnyHandle^>^ GetRelatedElements()
member GetRelatedElements : unit -> ICollection<IFCAnyHandle>
Return Value
ICollection<IFCAnyHandle>
 The collection of elements.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace